Model: "ResNet_6"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 256, 256, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 256, 256, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 127, 127, 16)      448             random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 127, 127, 16)      64              conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 127, 127, 16)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 63, 63, 16)        0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 32, 32, 16)        2320            max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 32, 32, 16)        64              conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 32, 32, 16)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 32, 32, 32)        4640            activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 32, 32, 32)        128             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 32, 32, 32)        0               batch_normalization_2[0][0]   
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 32, 32, 32)        544             max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
add (Add)                                       (None, 32, 32, 32)        0               activation_2[0][0]            
                                                                                          conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 32, 32, 32)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 16, 16, 32)        9248            activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 16, 16, 32)        128             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 16, 16, 32)        0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 16, 16, 64)        18496           activation_4[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 16, 16, 64)        256             conv2d_5[0][0]                
________________________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 16, 16, 64)        0               batch_normalization_4[0][0]   
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 16, 16, 64)        2112            activation_3[0][0]            
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 16, 16, 64)        0               activation_5[0][0]            
                                                                                          conv2d_6[0][0]                
________________________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 16, 16, 64)        0               add_1[0][0]                   
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                               (None, 8, 8, 64)          36928           activation_6[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)      (None, 8, 8, 64)          256             conv2d_7[0][0]                
________________________________________________________________________________________________________________________
activation_7 (Activation)                       (None, 8, 8, 64)          0               batch_normalization_5[0][0]   
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                               (None, 8, 8, 128)         73856           activation_7[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)      (None, 8, 8, 128)         512             conv2d_8[0][0]                
________________________________________________________________________________________________________________________
activation_8 (Activation)                       (None, 8, 8, 128)         0               batch_normalization_6[0][0]   
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                               (None, 8, 8, 128)         8320            activation_6[0][0]            
________________________________________________________________________________________________________________________
add_2 (Add)                                     (None, 8, 8, 128)         0               activation_8[0][0]            
                                                                                          conv2d_9[0][0]                
________________________________________________________________________________________________________________________
activation_9 (Activation)                       (None, 8, 8, 128)         0               add_2[0][0]                   
________________________________________________________________________________________________________________________
flatten (Flatten)                               (None, 8192)              0               activation_9[0][0]            
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 29)                237597          flatten[0][0]                 
========================================================================================================================
Total params: 395,917
Trainable params: 395,213
Non-trainable params: 704
________________________________________________________________________________________________________________________
