Model: "ResNet_6"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
zero_padding2d (ZeroPadding2D)                  (None, 262, 262, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 262, 262, 3)       0               zero_padding2d[0][0]          
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 262, 262, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 131, 131, 64)      9472            random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 131, 131, 64)      256             conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 131, 131, 64)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 66, 66, 64)        0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 66, 66, 64)        36928           max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 66, 66, 64)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 66, 66, 64)        36928           activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
add (Add)                                       (None, 66, 66, 64)        0               batch_normalization_2[0][0]   
                                                                                          max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 66, 66, 64)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 66, 66, 64)        36928           activation_2[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 66, 66, 64)        0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 66, 66, 64)        36928           activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 66, 66, 64)        0               batch_normalization_4[0][0]   
                                                                                          activation_2[0][0]            
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 66, 66, 64)        0               add_1[0][0]                   
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 66, 66, 64)        36928           activation_4[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_5[0][0]                
________________________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 66, 66, 64)        0               batch_normalization_5[0][0]   
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 66, 66, 64)        36928           activation_5[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_6[0][0]                
________________________________________________________________________________________________________________________
add_2 (Add)                                     (None, 66, 66, 64)        0               batch_normalization_6[0][0]   
                                                                                          activation_4[0][0]            
________________________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 66, 66, 64)        0               add_2[0][0]                   
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                               (None, 33, 33, 128)       73856           activation_6[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_7[0][0]                
________________________________________________________________________________________________________________________
activation_7 (Activation)                       (None, 33, 33, 128)       0               batch_normalization_7[0][0]   
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                               (None, 33, 33, 128)       147584          activation_7[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_8[0][0]                
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                               (None, 33, 33, 128)       8320            activation_6[0][0]            
________________________________________________________________________________________________________________________
add_3 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_8[0][0]   
                                                                                          conv2d_9[0][0]                
________________________________________________________________________________________________________________________
activation_8 (Activation)                       (None, 33, 33, 128)       0               add_3[0][0]                   
________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                              (None, 33, 33, 128)       147584          activation_8[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_10[0][0]               
________________________________________________________________________________________________________________________
activation_9 (Activation)                       (None, 33, 33, 128)       0               batch_normalization_9[0][0]   
________________________________________________________________________________________________________________________
conv2d_11 (Conv2D)                              (None, 33, 33, 128)       147584          activation_9[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)     (None, 33, 33, 128)       512             conv2d_11[0][0]               
________________________________________________________________________________________________________________________
add_4 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_10[0][0]  
                                                                                          activation_8[0][0]            
________________________________________________________________________________________________________________________
activation_10 (Activation)                      (None, 33, 33, 128)       0               add_4[0][0]                   
________________________________________________________________________________________________________________________
conv2d_12 (Conv2D)                              (None, 33, 33, 128)       147584          activation_10[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)     (None, 33, 33, 128)       512             conv2d_12[0][0]               
________________________________________________________________________________________________________________________
activation_11 (Activation)                      (None, 33, 33, 128)       0               batch_normalization_11[0][0]  
________________________________________________________________________________________________________________________
conv2d_13 (Conv2D)                              (None, 33, 33, 128)       147584          activation_11[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)     (None, 33, 33, 128)       512             conv2d_13[0][0]               
________________________________________________________________________________________________________________________
add_5 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_12[0][0]  
                                                                                          activation_10[0][0]           
________________________________________________________________________________________________________________________
activation_12 (Activation)                      (None, 33, 33, 128)       0               add_5[0][0]                   
________________________________________________________________________________________________________________________
conv2d_14 (Conv2D)                              (None, 33, 33, 128)       147584          activation_12[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)     (None, 33, 33, 128)       512             conv2d_14[0][0]               
________________________________________________________________________________________________________________________
activation_13 (Activation)                      (None, 33, 33, 128)       0               batch_normalization_13[0][0]  
________________________________________________________________________________________________________________________
conv2d_15 (Conv2D)                              (None, 33, 33, 128)       147584          activation_13[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_14 (BatchNormalization)     (None, 33, 33, 128)       512             conv2d_15[0][0]               
________________________________________________________________________________________________________________________
add_6 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_14[0][0]  
                                                                                          activation_12[0][0]           
________________________________________________________________________________________________________________________
activation_14 (Activation)                      (None, 33, 33, 128)       0               add_6[0][0]                   
________________________________________________________________________________________________________________________
conv2d_16 (Conv2D)                              (None, 17, 17, 256)       295168          activation_14[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_15 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_16[0][0]               
________________________________________________________________________________________________________________________
activation_15 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_15[0][0]  
________________________________________________________________________________________________________________________
conv2d_17 (Conv2D)                              (None, 17, 17, 256)       590080          activation_15[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_16 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_17[0][0]               
________________________________________________________________________________________________________________________
conv2d_18 (Conv2D)                              (None, 17, 17, 256)       33024           activation_14[0][0]           
________________________________________________________________________________________________________________________
add_7 (Add)                                     (None, 17, 17, 256)       0               batch_normalization_16[0][0]  
                                                                                          conv2d_18[0][0]               
________________________________________________________________________________________________________________________
activation_16 (Activation)                      (None, 17, 17, 256)       0               add_7[0][0]                   
________________________________________________________________________________________________________________________
conv2d_19 (Conv2D)                              (None, 17, 17, 256)       590080          activation_16[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_17 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_19[0][0]               
________________________________________________________________________________________________________________________
activation_17 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_17[0][0]  
________________________________________________________________________________________________________________________
conv2d_20 (Conv2D)                              (None, 17, 17, 256)       590080          activation_17[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_18 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_20[0][0]               
________________________________________________________________________________________________________________________
add_8 (Add)                                     (None, 17, 17, 256)       0               batch_normalization_18[0][0]  
                                                                                          activation_16[0][0]           
________________________________________________________________________________________________________________________
activation_18 (Activation)                      (None, 17, 17, 256)       0               add_8[0][0]                   
________________________________________________________________________________________________________________________
conv2d_21 (Conv2D)                              (None, 17, 17, 256)       590080          activation_18[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_19 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_21[0][0]               
________________________________________________________________________________________________________________________
activation_19 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_19[0][0]  
________________________________________________________________________________________________________________________
conv2d_22 (Conv2D)                              (None, 17, 17, 256)       590080          activation_19[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_20 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_22[0][0]               
________________________________________________________________________________________________________________________
add_9 (Add)                                     (None, 17, 17, 256)       0               batch_normalization_20[0][0]  
                                                                                          activation_18[0][0]           
________________________________________________________________________________________________________________________
activation_20 (Activation)                      (None, 17, 17, 256)       0               add_9[0][0]                   
________________________________________________________________________________________________________________________
conv2d_23 (Conv2D)                              (None, 17, 17, 256)       590080          activation_20[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_21 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_23[0][0]               
________________________________________________________________________________________________________________________
activation_21 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_21[0][0]  
________________________________________________________________________________________________________________________
conv2d_24 (Conv2D)                              (None, 17, 17, 256)       590080          activation_21[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_22 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_24[0][0]               
________________________________________________________________________________________________________________________
add_10 (Add)                                    (None, 17, 17, 256)       0               batch_normalization_22[0][0]  
                                                                                          activation_20[0][0]           
________________________________________________________________________________________________________________________
activation_22 (Activation)                      (None, 17, 17, 256)       0               add_10[0][0]                  
________________________________________________________________________________________________________________________
conv2d_25 (Conv2D)                              (None, 17, 17, 256)       590080          activation_22[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_23 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_25[0][0]               
________________________________________________________________________________________________________________________
activation_23 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_23[0][0]  
________________________________________________________________________________________________________________________
conv2d_26 (Conv2D)                              (None, 17, 17, 256)       590080          activation_23[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_24 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_26[0][0]               
________________________________________________________________________________________________________________________
add_11 (Add)                                    (None, 17, 17, 256)       0               batch_normalization_24[0][0]  
                                                                                          activation_22[0][0]           
________________________________________________________________________________________________________________________
activation_24 (Activation)                      (None, 17, 17, 256)       0               add_11[0][0]                  
________________________________________________________________________________________________________________________
conv2d_27 (Conv2D)                              (None, 17, 17, 256)       590080          activation_24[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_25 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_27[0][0]               
________________________________________________________________________________________________________________________
activation_25 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_25[0][0]  
________________________________________________________________________________________________________________________
conv2d_28 (Conv2D)                              (None, 17, 17, 256)       590080          activation_25[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_26 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_28[0][0]               
________________________________________________________________________________________________________________________
add_12 (Add)                                    (None, 17, 17, 256)       0               batch_normalization_26[0][0]  
                                                                                          activation_24[0][0]           
________________________________________________________________________________________________________________________
activation_26 (Activation)                      (None, 17, 17, 256)       0               add_12[0][0]                  
________________________________________________________________________________________________________________________
conv2d_29 (Conv2D)                              (None, 9, 9, 512)         1180160         activation_26[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_27 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_29[0][0]               
________________________________________________________________________________________________________________________
activation_27 (Activation)                      (None, 9, 9, 512)         0               batch_normalization_27[0][0]  
________________________________________________________________________________________________________________________
conv2d_30 (Conv2D)                              (None, 9, 9, 512)         2359808         activation_27[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_28 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_30[0][0]               
________________________________________________________________________________________________________________________
conv2d_31 (Conv2D)                              (None, 9, 9, 512)         131584          activation_26[0][0]           
________________________________________________________________________________________________________________________
add_13 (Add)                                    (None, 9, 9, 512)         0               batch_normalization_28[0][0]  
                                                                                          conv2d_31[0][0]               
________________________________________________________________________________________________________________________
activation_28 (Activation)                      (None, 9, 9, 512)         0               add_13[0][0]                  
________________________________________________________________________________________________________________________
conv2d_32 (Conv2D)                              (None, 9, 9, 512)         2359808         activation_28[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_29 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_32[0][0]               
________________________________________________________________________________________________________________________
activation_29 (Activation)                      (None, 9, 9, 512)         0               batch_normalization_29[0][0]  
________________________________________________________________________________________________________________________
conv2d_33 (Conv2D)                              (None, 9, 9, 512)         2359808         activation_29[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_30 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_33[0][0]               
________________________________________________________________________________________________________________________
add_14 (Add)                                    (None, 9, 9, 512)         0               batch_normalization_30[0][0]  
                                                                                          activation_28[0][0]           
________________________________________________________________________________________________________________________
activation_30 (Activation)                      (None, 9, 9, 512)         0               add_14[0][0]                  
________________________________________________________________________________________________________________________
conv2d_34 (Conv2D)                              (None, 9, 9, 512)         2359808         activation_30[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_31 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_34[0][0]               
________________________________________________________________________________________________________________________
activation_31 (Activation)                      (None, 9, 9, 512)         0               batch_normalization_31[0][0]  
________________________________________________________________________________________________________________________
conv2d_35 (Conv2D)                              (None, 9, 9, 512)         2359808         activation_31[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_32 (BatchNormalization)     (None, 9, 9, 512)         2048            conv2d_35[0][0]               
________________________________________________________________________________________________________________________
add_15 (Add)                                    (None, 9, 9, 512)         0               batch_normalization_32[0][0]  
                                                                                          activation_30[0][0]           
________________________________________________________________________________________________________________________
activation_32 (Activation)                      (None, 9, 9, 512)         0               add_15[0][0]                  
________________________________________________________________________________________________________________________
average_pooling2d (AveragePooling2D)            (None, 5, 5, 512)         0               activation_32[0][0]           
________________________________________________________________________________________________________________________
flatten (Flatten)                               (None, 12800)             0               average_pooling2d[0][0]       
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 512)               6554112         flatten[0][0]                 
________________________________________________________________________________________________________________________
dense_1 (Dense)                                 (None, 29)                14877           dense[0][0]                   
========================================================================================================================
Total params: 27,875,613
Trainable params: 27,860,381
Non-trainable params: 15,232
________________________________________________________________________________________________________________________
