Model: "ResNet"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
zero_padding2d (ZeroPadding2D)                  (None, 262, 262, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 262, 262, 3)       0               zero_padding2d[0][0]          
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 262, 262, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 131, 131, 64)      9472            random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 131, 131, 64)      256             conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 131, 131, 64)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 66, 66, 64)        0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 66, 66, 64)        36928           max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 66, 66, 64)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 66, 66, 64)        36928           activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
add (Add)                                       (None, 66, 66, 64)        0               batch_normalization_2[0][0]   
                                                                                          max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 66, 66, 64)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 66, 66, 64)        36928           activation_2[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 66, 66, 64)        0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 66, 66, 64)        36928           activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 66, 66, 64)        256             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 66, 66, 64)        0               batch_normalization_4[0][0]   
                                                                                          activation_2[0][0]            
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 66, 66, 64)        0               add_1[0][0]                   
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 33, 33, 128)       73856           activation_4[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_5[0][0]                
________________________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 33, 33, 128)       0               batch_normalization_5[0][0]   
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 33, 33, 128)       147584          activation_5[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_6[0][0]                
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                               (None, 33, 33, 128)       8320            activation_4[0][0]            
________________________________________________________________________________________________________________________
add_2 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_6[0][0]   
                                                                                          conv2d_7[0][0]                
________________________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 33, 33, 128)       0               add_2[0][0]                   
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                               (None, 33, 33, 128)       147584          activation_6[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_8[0][0]                
________________________________________________________________________________________________________________________
activation_7 (Activation)                       (None, 33, 33, 128)       0               batch_normalization_7[0][0]   
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                               (None, 33, 33, 128)       147584          activation_7[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)      (None, 33, 33, 128)       512             conv2d_9[0][0]                
________________________________________________________________________________________________________________________
add_3 (Add)                                     (None, 33, 33, 128)       0               batch_normalization_8[0][0]   
                                                                                          activation_6[0][0]            
________________________________________________________________________________________________________________________
activation_8 (Activation)                       (None, 33, 33, 128)       0               add_3[0][0]                   
________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                              (None, 17, 17, 256)       295168          activation_8[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)      (None, 17, 17, 256)       1024            conv2d_10[0][0]               
________________________________________________________________________________________________________________________
activation_9 (Activation)                       (None, 17, 17, 256)       0               batch_normalization_9[0][0]   
________________________________________________________________________________________________________________________
conv2d_11 (Conv2D)                              (None, 17, 17, 256)       590080          activation_9[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_11[0][0]               
________________________________________________________________________________________________________________________
conv2d_12 (Conv2D)                              (None, 17, 17, 256)       33024           activation_8[0][0]            
________________________________________________________________________________________________________________________
add_4 (Add)                                     (None, 17, 17, 256)       0               batch_normalization_10[0][0]  
                                                                                          conv2d_12[0][0]               
________________________________________________________________________________________________________________________
activation_10 (Activation)                      (None, 17, 17, 256)       0               add_4[0][0]                   
________________________________________________________________________________________________________________________
conv2d_13 (Conv2D)                              (None, 17, 17, 256)       590080          activation_10[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_13[0][0]               
________________________________________________________________________________________________________________________
activation_11 (Activation)                      (None, 17, 17, 256)       0               batch_normalization_11[0][0]  
________________________________________________________________________________________________________________________
conv2d_14 (Conv2D)                              (None, 17, 17, 256)       590080          activation_11[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)     (None, 17, 17, 256)       1024            conv2d_14[0][0]               
________________________________________________________________________________________________________________________
add_5 (Add)                                     (None, 17, 17, 256)       0               batch_normalization_12[0][0]  
                                                                                          activation_10[0][0]           
________________________________________________________________________________________________________________________
activation_12 (Activation)                      (None, 17, 17, 256)       0               add_5[0][0]                   
________________________________________________________________________________________________________________________
global_average_pooling2d (GlobalAveragePooling2 (None, 256)               0               activation_12[0][0]           
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 29)                7453            global_average_pooling2d[0][0]
========================================================================================================================
Total params: 2,795,421
Trainable params: 2,791,709
Non-trainable params: 3,712
________________________________________________________________________________________________________________________
