Model: "ResNet_8"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 256, 256, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 256, 256, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 128, 128, 64)      9472            random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 128, 128, 64)      256             conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 128, 128, 64)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 64, 64, 64)        0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 64, 64, 64)        36928           max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 64, 64, 64)        256             conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 64, 64, 64)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 64, 64, 64)        36928           activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 64, 64, 64)        256             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
add (Add)                                       (None, 64, 64, 64)        0               batch_normalization_2[0][0]   
                                                                                          max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 64, 64, 64)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 32, 32, 128)       73856           activation_2[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 32, 32, 128)       0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 32, 32, 128)       147584          activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 32, 32, 128)       8320            activation_2[0][0]            
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 32, 32, 128)       0               batch_normalization_4[0][0]   
                                                                                          conv2d_5[0][0]                
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 32, 32, 128)       0               add_1[0][0]                   
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 32, 32, 128)       147584          activation_4[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_6[0][0]                
________________________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 32, 32, 128)       0               batch_normalization_5[0][0]   
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                               (None, 32, 32, 128)       147584          activation_5[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_7[0][0]                
________________________________________________________________________________________________________________________
add_2 (Add)                                     (None, 32, 32, 128)       0               batch_normalization_6[0][0]   
                                                                                          activation_4[0][0]            
________________________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 32, 32, 128)       0               add_2[0][0]                   
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                               (None, 16, 16, 128)       147584          activation_6[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)      (None, 16, 16, 128)       512             conv2d_8[0][0]                
________________________________________________________________________________________________________________________
activation_7 (Activation)                       (None, 16, 16, 128)       0               batch_normalization_7[0][0]   
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                               (None, 16, 16, 128)       147584          activation_7[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)      (None, 16, 16, 128)       512             conv2d_9[0][0]                
________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                              (None, 16, 16, 128)       16512           activation_6[0][0]            
________________________________________________________________________________________________________________________
add_3 (Add)                                     (None, 16, 16, 128)       0               batch_normalization_8[0][0]   
                                                                                          conv2d_10[0][0]               
________________________________________________________________________________________________________________________
activation_8 (Activation)                       (None, 16, 16, 128)       0               add_3[0][0]                   
________________________________________________________________________________________________________________________
global_average_pooling2d (GlobalAveragePooling2 (None, 128)               0               activation_8[0][0]            
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 512)               66048           global_average_pooling2d[0][0]
________________________________________________________________________________________________________________________
dense_1 (Dense)                                 (None, 29)                14877           dense[0][0]                   
========================================================================================================================
Total params: 1,004,701
Trainable params: 1,002,781
Non-trainable params: 1,920
________________________________________________________________________________________________________________________
