Model: "ResNet_6"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 256, 256, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 256, 256, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 256, 256, 64)      9472            random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 256, 256, 64)      256             conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 256, 256, 64)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 128, 128, 64)      0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 64, 64, 64)        36928           max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 64, 64, 64)        256             conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 64, 64, 64)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 64, 64, 64)        36928           activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 64, 64, 64)        256             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 64, 64, 64)        0               batch_normalization_2[0][0]   
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 64, 64, 64)        4160            max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
add (Add)                                       (None, 64, 64, 64)        0               activation_2[0][0]            
                                                                                          conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 64, 64, 64)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 32, 32, 128)       73856           activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 32, 32, 128)       0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 32, 32, 128)       147584          activation_4[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 32, 32, 128)       512             conv2d_5[0][0]                
________________________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 32, 32, 128)       0               batch_normalization_4[0][0]   
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 32, 32, 128)       8320            activation_3[0][0]            
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 32, 32, 128)       0               activation_5[0][0]            
                                                                                          conv2d_6[0][0]                
________________________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 32, 32, 128)       0               add_1[0][0]                   
________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                               (None, 16, 16, 256)       295168          activation_6[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)      (None, 16, 16, 256)       1024            conv2d_7[0][0]                
________________________________________________________________________________________________________________________
activation_7 (Activation)                       (None, 16, 16, 256)       0               batch_normalization_5[0][0]   
________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                               (None, 16, 16, 256)       590080          activation_7[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)      (None, 16, 16, 256)       1024            conv2d_8[0][0]                
________________________________________________________________________________________________________________________
activation_8 (Activation)                       (None, 16, 16, 256)       0               batch_normalization_6[0][0]   
________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                               (None, 16, 16, 256)       33024           activation_6[0][0]            
________________________________________________________________________________________________________________________
add_2 (Add)                                     (None, 16, 16, 256)       0               activation_8[0][0]            
                                                                                          conv2d_9[0][0]                
________________________________________________________________________________________________________________________
activation_9 (Activation)                       (None, 16, 16, 256)       0               add_2[0][0]                   
________________________________________________________________________________________________________________________
average_pooling2d (AveragePooling2D)            (None, 8, 8, 256)         0               activation_9[0][0]            
________________________________________________________________________________________________________________________
flatten (Flatten)                               (None, 16384)             0               average_pooling2d[0][0]       
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 512)               8389120         flatten[0][0]                 
________________________________________________________________________________________________________________________
dense_1 (Dense)                                 (None, 29)                14877           dense[0][0]                   
========================================================================================================================
Total params: 9,643,357
Trainable params: 9,641,437
Non-trainable params: 1,920
________________________________________________________________________________________________________________________
