Model: "ResNet_8"
________________________________________________________________________________________________________________________
Layer (type)                                    Output Shape              Param #         Connected to                  
========================================================================================================================
input_1 (InputLayer)                            [(None, 256, 256, 3)]     0                                             
________________________________________________________________________________________________________________________
rescaling (Rescaling)                           (None, 256, 256, 3)       0               input_1[0][0]                 
________________________________________________________________________________________________________________________
random_flip (RandomFlip)                        (None, 256, 256, 3)       0               rescaling[0][0]               
________________________________________________________________________________________________________________________
random_rotation (RandomRotation)                (None, 256, 256, 3)       0               random_flip[0][0]             
________________________________________________________________________________________________________________________
conv2d (Conv2D)                                 (None, 127, 127, 16)      448             random_rotation[0][0]         
________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)        (None, 127, 127, 16)      64              conv2d[0][0]                  
________________________________________________________________________________________________________________________
activation (Activation)                         (None, 127, 127, 16)      0               batch_normalization[0][0]     
________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 63, 63, 16)        0               activation[0][0]              
________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 32, 32, 16)        2320            max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)      (None, 32, 32, 16)        64              conv2d_1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 32, 32, 16)        0               batch_normalization_1[0][0]   
________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 32, 32, 32)        4640            activation_1[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)      (None, 32, 32, 32)        128             conv2d_2[0][0]                
________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 32, 32, 32)        544             max_pooling2d[0][0]           
________________________________________________________________________________________________________________________
add (Add)                                       (None, 32, 32, 32)        0               batch_normalization_2[0][0]   
                                                                                          conv2d_3[0][0]                
________________________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 32, 32, 32)        0               add[0][0]                     
________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                               (None, 16, 16, 32)        9248            activation_2[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)      (None, 16, 16, 32)        128             conv2d_4[0][0]                
________________________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 16, 16, 32)        0               batch_normalization_3[0][0]   
________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                               (None, 16, 16, 64)        18496           activation_3[0][0]            
________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)      (None, 16, 16, 64)        256             conv2d_5[0][0]                
________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                               (None, 16, 16, 64)        2112            activation_2[0][0]            
________________________________________________________________________________________________________________________
add_1 (Add)                                     (None, 16, 16, 64)        0               batch_normalization_4[0][0]   
                                                                                          conv2d_6[0][0]                
________________________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 16, 16, 64)        0               add_1[0][0]                   
________________________________________________________________________________________________________________________
global_average_pooling2d (GlobalAveragePooling2 (None, 64)                0               activation_4[0][0]            
________________________________________________________________________________________________________________________
dense (Dense)                                   (None, 29)                1885            global_average_pooling2d[0][0]
========================================================================================================================
Total params: 40,333
Trainable params: 40,013
Non-trainable params: 320
________________________________________________________________________________________________________________________
